## ✅ Terraform Apply: Dev

Successfully applied infrastructure changes to **dev** environment!

<details>
<summary>📋 Apply Output (click to expand)</summary>

```terraform
time=2025-12-11T09:12:20Z level=info msg=The stack at /home/runner/work/interview/interview/sre/terragrunt/environments/dev will be processed in the following order for command apply:
Group 1
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking

Group 2
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks

Group 3
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/iam


time=2025-12-11T09:12:20Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/networking into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking/.terragrunt-cache/U5oswpjzT80__bq6z5CjLFPgEhE/oe-HFdXMekaLtOb26xJTuUQbvwc prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking] 

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1maws_cloudwatch_log_group.flow_logs[0]: Refreshing state... [id=/aws/vpc/tekmetric-dev][0m
[0m[1maws_vpc.main: Refreshing state... [id=vpc-0defea0fd59e872b3][0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1maws_iam_role.flow_logs[0]: Refreshing state... [id=tekmetric-dev-vpc-flow-logs][0m
[0m[1maws_iam_role_policy.flow_logs[0]: Refreshing state... [id=tekmetric-dev-vpc-flow-logs:tekmetric-dev-vpc-flow-logs][0m
[0m[1maws_internet_gateway.main: Refreshing state... [id=igw-04e1122f9b3146665][0m
[0m[1maws_flow_log.main[0]: Refreshing state... [id=fl-0e86b8eee628692cf][0m
[0m[1maws_security_group.eks_cluster: Refreshing state... [id=sg-03e1661bfb8666734][0m
[0m[1maws_subnet.private[1]: Refreshing state... [id=subnet-02e139052a4674fde][0m
[0m[1maws_subnet.private[0]: Refreshing state... [id=subnet-00df2f6c22bdc31f3][0m
[0m[1maws_subnet.public[2]: Refreshing state... [id=subnet-0e93434d9ff961225][0m
[0m[1maws_subnet.private[2]: Refreshing state... [id=subnet-05955479dedc43f10][0m
[0m[1maws_subnet.public[0]: Refreshing state... [id=subnet-0916f9d7db46bef68][0m
[0m[1maws_subnet.public[1]: Refreshing state... [id=subnet-0c8ba8495c153ef82][0m
[0m[1maws_security_group.vpc_endpoints[0]: Refreshing state... [id=sg-00c8dac087ffaf468][0m
[0m[1maws_route_table.private[0]: Refreshing state... [id=rtb-0dfbdc1da982cb2f7][0m
[0m[1maws_security_group.eks_nodes: Refreshing state... [id=sg-088578779ccdcc036][0m
[0m[1maws_route_table.public: Refreshing state... [id=rtb-06082baf227d2dd8e][0m
[0m[1maws_eip.nat[0]: Refreshing state... [id=eipalloc-0e000bc228b9aaf45][0m
[0m[1maws_security_group_rule.cluster_egress_all: Refreshing state... [id=sgrule-3475581653][0m
[0m[1maws_security_group_rule.nodes_internal: Refreshing state... [id=sgrule-131560817][0m
[0m[1maws_security_group_rule.nodes_egress_all: Refreshing state... [id=sgrule-1928205594][0m
[0m[1maws_vpc_endpoint.ecr_dkr[0]: Refreshing state... [id=vpce-0a270f78db4898196][0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Refreshing state... [id=vpce-08fd0be43145bab83][0m
[0m[1maws_security_group_rule.cluster_ingress_nodes: Refreshing state... [id=sgrule-916659532][0m
[0m[1maws_security_group_rule.nodes_cluster_ingress: Refreshing state... [id=sgrule-1626025327][0m
[0m[1maws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05a2558096c0a979c][0m
[0m[1maws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0181fc47d86950350][0m
[0m[1maws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0739eab22a8a4310c][0m
[0m[1maws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0975570656bb3912b][0m
[0m[1maws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-07487adf5d7115347][0m
[0m[1maws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0160a699a4726c53e][0m
[0m[1maws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b6fd39421214c53a][0m
[0m[1maws_nat_gateway.main[0]: Refreshing state... [id=nat-0c025f9446fc156ac][0m
[0m[1maws_route.private_nat[0]: Refreshing state... [id=r-rtb-0dfbdc1da982cb2f71080289494][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # aws_cloudwatch_log_group.flow_logs[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_cloudwatch_log_group" "flow_logs" {
        id                = "/aws/vpc/tekmetric-dev"
        name              = "/aws/vpc/tekmetric-dev"
      [33m~[0m[0m retention_in_days = 0 [33m->[0m[0m 7
      [33m~[0m[0m tags              = {
            "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-flow-logs"
        }
      [33m~[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-flow-logs"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 1 to change, 0 to destroy.
[0m[0m[1maws_cloudwatch_log_group.flow_logs[0]: Modifying... [id=/aws/vpc/tekmetric-dev][0m[0m
[0m[1maws_cloudwatch_log_group.flow_logs[0]: Modifications complete after 1s [id=/aws/vpc/tekmetric-dev][0m
[0m[1m[32m
Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
[0m[0m[1m[32m
Outputs:

[0mavailability_zones = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
ecr_api_vpc_endpoint_id = "vpce-08fd0be43145bab83"
ecr_dkr_vpc_endpoint_id = "vpce-0a270f78db4898196"
eks_cluster_security_group_id = "sg-03e1661bfb8666734"
eks_nodes_security_group_id = "sg-088578779ccdcc036"
flow_logs_iam_role_arn = "arn:aws:iam::096610237522:role/tekmetric-dev-vpc-flow-logs"
flow_logs_log_group_name = "/aws/vpc/tekmetric-dev"
internet_gateway_id = "igw-04e1122f9b3146665"
nat_gateway_ids = [
  "nat-0c025f9446fc156ac",
]
nat_gateway_ips = [
  "34.231.74.21",
]
private_subnet_cidrs = [
  "10.0.1.0/24",
  "10.0.2.0/24",
  "10.0.3.0/24",
]
private_subnet_ids = [
  "subnet-00df2f6c22bdc31f3",
  "subnet-02e139052a4674fde",
  "subnet-05955479dedc43f10",
]
public_subnet_cidrs = [
  "10.0.101.0/24",
  "10.0.102.0/24",
  "10.0.103.0/24",
]
public_subnet_ids = [
  "subnet-0916f9d7db46bef68",
  "subnet-0c8ba8495c153ef82",
  "subnet-0e93434d9ff961225",
]
s3_vpc_endpoint_id = "vpce-07487adf5d7115347"
vpc_arn = "arn:aws:ec2:us-east-1:096610237522:vpc/vpc-0defea0fd59e872b3"
vpc_cidr = "10.0.0.0/16"
vpc_endpoints_security_group_id = "sg-00c8dac087ffaf468"
vpc_id = "vpc-0defea0fd59e872b3"
time=2025-12-11T09:12:35Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/eks into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks/.terragrunt-cache/MFMwTy_bkT1Qu8G6844iSTcry_U/R4houoVHchUziigUPrFTxzYi9ew prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks] 

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Finding latest version of hashicorp/tls...
- Installing hashicorp/tls v4.1.0...
- Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_addon_version.coredns[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "coredns" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.ebs_csi_driver[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "ebs_csi_driver" {
      [32m+[0m[0m addon_name         = "aws-ebs-csi-driver"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.kube_proxy[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "kube_proxy" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.vpc_cni[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "vpc_cni" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.tls_certificate.cluster[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "tls_certificate" "cluster" {
      [32m+[0m[0m certificates = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m url          = (known after apply)
    }

[1m  # aws_cloudwatch_log_group.cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "cluster" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/eks/tekmetric-dev/cluster"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev-logs"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev-logs"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_addon.coredns[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "coredns" {
      [32m+[0m[0m addon_name                  = "coredns"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_addon.ebs_csi_driver[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "ebs_csi_driver" {
      [32m+[0m[0m addon_name                  = "aws-ebs-csi-driver"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_addon.kube_proxy[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "kube_proxy" {
      [32m+[0m[0m addon_name                  = "kube-proxy"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_addon.vpc_cni[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "vpc_cni" {
      [32m+[0m[0m addon_name                  = "vpc-cni"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_cluster.main[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "main" {
      [32m+[0m[0m arn                           = (known after apply)
      [32m+[0m[0m bootstrap_self_managed_addons = true
      [32m+[0m[0m certificate_authority         = (known after apply)
      [32m+[0m[0m cluster_id                    = (known after apply)
      [32m+[0m[0m created_at                    = (known after apply)
      [32m+[0m[0m enabled_cluster_log_types     = [
          [32m+[0m[0m "api",
          [32m+[0m[0m "audit",
          [32m+[0m[0m "authenticator",
        ]
      [32m+[0m[0m endpoint                      = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m identity                      = (known after apply)
      [32m+[0m[0m name                          = "tekmetric-dev"
      [32m+[0m[0m platform_version              = (known after apply)
      [32m+[0m[0m role_arn                      = (known after apply)
      [32m+[0m[0m status                        = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev"
        }
      [32m+[0m[0m tags_all                      = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m version                       = "1.28"

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = true
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = (known after apply)
          [32m+[0m[0m subnet_ids                = [
              [32m+[0m[0m "subnet-00df2f6c22bdc31f3",
              [32m+[0m[0m "subnet-02e139052a4674fde",
              [32m+[0m[0m "subnet-05955479dedc43f10",
              [32m+[0m[0m "subnet-0916f9d7db46bef68",
              [32m+[0m[0m "subnet-0c8ba8495c153ef82",
              [32m+[0m[0m "subnet-0e93434d9ff961225",
            ]
          [32m+[0m[0m vpc_id                    = (known after apply)
        }
    }

[1m  # aws_eks_node_group.main["general"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "main" {
      [32m+[0m[0m ami_type               = (known after apply)
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = "ON_DEMAND"
      [32m+[0m[0m cluster_name           = "tekmetric-dev"
      [32m+[0m[0m disk_size              = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "t3.medium",
        ]
      [32m+[0m[0m labels                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "NodeGroup"   = "general"
          [32m+[0m[0m "role"        = "general"
        }
      [32m+[0m[0m node_group_name        = "tekmetric-dev-general"
      [32m+[0m[0m node_group_name_prefix = (known after apply)
      [32m+[0m[0m node_role_arn          = (known after apply)
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = [
          [32m+[0m[0m "subnet-00df2f6c22bdc31f3",
          [32m+[0m[0m "subnet-02e139052a4674fde",
          [32m+[0m[0m "subnet-05955479dedc43f10",
        ]
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment"                             = "dev"
          [32m+[0m[0m "ManagedBy"                               = "Terraform"
          [32m+[0m[0m "Module"                                  = "eks"
          [32m+[0m[0m "Name"                                    = "tekmetric-dev-general"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/enabled"       = "true"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/tekmetric-dev" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment"                             = "dev"
          [32m+[0m[0m "ManagedBy"                               = "Terraform"
          [32m+[0m[0m "Module"                                  = "eks"
          [32m+[0m[0m "Name"                                    = "tekmetric-dev-general"
          [32m+[0m[0m "Project"                                 = "tekmetric"
          [32m+[0m[0m "Repository"                              = "interview"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/enabled"       = "true"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/tekmetric-dev" = "owned"
        }
      [32m+[0m[0m version                = (known after apply)

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 2
          [32m+[0m[0m max_size     = 10
          [32m+[0m[0m min_size     = 1
        }

      [32m+[0m[0m update_config {
          [32m+[0m[0m max_unavailable = 1
        }
    }

[1m  # aws_iam_openid_connect_provider.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_openid_connect_provider" "cluster" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m client_id_list  = [
          [32m+[0m[0m "sts.amazonaws.com",
        ]
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev-oidc"
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev-oidc"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m thumbprint_list = (known after apply)
      [32m+[0m[0m url             = (known after apply)
    }

[1m  # aws_iam_role.cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "cluster" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "tekmetric-dev-cluster-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role.node_group[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "node_group" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "tekmetric-dev-node-group-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.cluster_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cluster_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m[0m role       = "tekmetric-dev-cluster-role"
    }

[1m  # aws_iam_role_policy_attachment.cluster_vpc_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cluster_vpc_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      [32m+[0m[0m role       = "tekmetric-dev-cluster-role"
    }

[1m  # aws_iam_role_policy_attachment.node_group_cni_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_group_cni_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = "tekmetric-dev-node-group-role"
    }

[1m  # aws_iam_role_policy_attachment.node_group_registry_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_group_registry_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      [32m+[0m[0m role       = "tekmetric-dev-node-group-role"
    }

[1m  # aws_iam_role_policy_attachment.node_group_worker_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_group_worker_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      [32m+[0m[0m role       = "tekmetric-dev-node-group-role"
    }

[1mPlan:[0m 15 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m cluster_arn                        = (known after apply)
  [32m+[0m[0m cluster_certificate_authority_data = (known after apply)
  [32m+[0m[0m cluster_endpoint                   = (known after apply)
  [32m+[0m[0m cluster_iam_role_arn               = (known after apply)
  [32m+[0m[0m cluster_id                         = (known after apply)
  [32m+[0m[0m cluster_oidc_issuer_url            = (known after apply)
  [32m+[0m[0m cluster_security_group_id          = (known after apply)
  [32m+[0m[0m node_group_iam_role_arn            = (known after apply)
  [32m+[0m[0m node_groups                        = {
      [32m+[0m[0m general = {
          [32m+[0m[0m arn           = (known after apply)
          [32m+[0m[0m capacity_type = "ON_DEMAND"
          [32m+[0m[0m id            = (known after apply)
          [32m+[0m[0m status        = (known after apply)
        }
    }
  [32m+[0m[0m oidc_provider_arn                  = (known after apply)
[0m[1maws_cloudwatch_log_group.cluster: Creating...[0m[0m
[0m[1maws_iam_role.node_group: Creating...[0m[0m
[0m[1maws_iam_role.cluster: Creating...[0m[0m
[0m[1maws_cloudwatch_log_group.cluster: Creation complete after 1s [id=/aws/eks/tekmetric-dev/cluster][0m
[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mcreating IAM Role (tekmetric-dev-cluster-role): operation error IAM: CreateRole, https response error StatusCode: 409, RequestID: 0d748116-e4be-4cee-a300-8e11c1fbed57, EntityAlreadyExists: Role with name tekmetric-dev-cluster-role already exists.[0m
[31m│[0m [0m
[31m│[0m [0m[0m  with aws_iam_role.cluster,
[31m│[0m [0m  on main.tf line 26, in resource "aws_iam_role" "cluster":
[31m│[0m [0m  26: resource "aws_iam_role" "cluster" [4m{[0m[0m
[31m│[0m [0m
[31m╵[0m[0m
[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mcreating IAM Role (tekmetric-dev-node-group-role): operation error IAM: CreateRole, https response error StatusCode: 409, RequestID: 26db7411-22b3-4617-997a-f5b5d762f823, EntityAlreadyExists: Role with name tekmetric-dev-node-group-role already exists.[0m
[31m│[0m [0m
[31m│[0m [0m[0m  with aws_iam_role.node_group,
[31m│[0m [0m  on main.tf line 106, in resource "aws_iam_role" "node_group":
[31m│[0m [0m 106: resource "aws_iam_role" "node_group" [4m{[0m[0m
[31m│[0m [0m
[31m╵[0m[0m
time=2025-12-11T09:12:46Z level=info msg=Encountered an error eligible for retrying. Sleeping 5s before retrying.
 prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks] 
[0m[1maws_cloudwatch_log_group.cluster: Refreshing state... [id=/aws/eks/tekmetric-dev/cluster][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_addon_version.coredns[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "coredns" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.ebs_csi_driver[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "ebs_csi_driver" {
      [32m+[0m[0m addon_name         = "aws-ebs-csi-driver"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.kube_proxy[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "kube_proxy" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.vpc_cni[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "vpc_cni" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.tls_certificate.cluster[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "tls_certificate" "cluster" {
      [32m+[0m[0m certificates = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m url          = (known after apply)
    }

[1m  # aws_eks_addon.coredns[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "coredns" {
      [32m+[0m[0m addon_name                  = "coredns"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_addon.ebs_csi_driver[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "ebs_csi_driver" {
      [32m+[0m[0m addon_name                  = "aws-ebs-csi-driver"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_addon.kube_proxy[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "kube_proxy" {
      [32m+[0m[0m addon_name                  = "kube-proxy"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_addon.vpc_cni[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "vpc_cni" {
      [32m+[0m[0m addon_name                  = "vpc-cni"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "tekmetric-dev"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "PRESERVE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eks_cluster.main[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "main" {
      [32m+[0m[0m arn                           = (known after apply)
      [32m+[0m[0m bootstrap_self_managed_addons = true
      [32m+[0m[0m certificate_authority         = (known after apply)
      [32m+[0m[0m cluster_id                    = (known after apply)
      [32m+[0m[0m created_at                    = (known after apply)
      [32m+[0m[0m enabled_cluster_log_types     = [
          [32m+[0m[0m "api",
          [32m+[0m[0m "audit",
          [32m+[0m[0m "authenticator",
        ]
      [32m+[0m[0m endpoint                      = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m identity                      = (known after apply)
      [32m+[0m[0m name                          = "tekmetric-dev"
      [32m+[0m[0m platform_version              = (known after apply)
      [32m+[0m[0m role_arn                      = (known after apply)
      [32m+[0m[0m status                        = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev"
        }
      [32m+[0m[0m tags_all                      = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m version                       = "1.28"

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = true
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = (known after apply)
          [32m+[0m[0m subnet_ids                = [
              [32m+[0m[0m "subnet-00df2f6c22bdc31f3",
              [32m+[0m[0m "subnet-02e139052a4674fde",
              [32m+[0m[0m "subnet-05955479dedc43f10",
              [32m+[0m[0m "subnet-0916f9d7db46bef68",
              [32m+[0m[0m "subnet-0c8ba8495c153ef82",
              [32m+[0m[0m "subnet-0e93434d9ff961225",
            ]
          [32m+[0m[0m vpc_id                    = (known after apply)
        }
    }

[1m  # aws_eks_node_group.main["general"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "main" {
      [32m+[0m[0m ami_type               = (known after apply)
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = "ON_DEMAND"
      [32m+[0m[0m cluster_name           = "tekmetric-dev"
      [32m+[0m[0m disk_size              = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "t3.medium",
        ]
      [32m+[0m[0m labels                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "NodeGroup"   = "general"
          [32m+[0m[0m "role"        = "general"
        }
      [32m+[0m[0m node_group_name        = "tekmetric-dev-general"
      [32m+[0m[0m node_group_name_prefix = (known after apply)
      [32m+[0m[0m node_role_arn          = (known after apply)
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = [
          [32m+[0m[0m "subnet-00df2f6c22bdc31f3",
          [32m+[0m[0m "subnet-02e139052a4674fde",
          [32m+[0m[0m "subnet-05955479dedc43f10",
        ]
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment"                             = "dev"
          [32m+[0m[0m "ManagedBy"                               = "Terraform"
          [32m+[0m[0m "Module"                                  = "eks"
          [32m+[0m[0m "Name"                                    = "tekmetric-dev-general"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/enabled"       = "true"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/tekmetric-dev" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment"                             = "dev"
          [32m+[0m[0m "ManagedBy"                               = "Terraform"
          [32m+[0m[0m "Module"                                  = "eks"
          [32m+[0m[0m "Name"                                    = "tekmetric-dev-general"
          [32m+[0m[0m "Project"                                 = "tekmetric"
          [32m+[0m[0m "Repository"                              = "interview"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/enabled"       = "true"
          [32m+[0m[0m "k8s.io/cluster-autoscaler/tekmetric-dev" = "owned"
        }
      [32m+[0m[0m version                = (known after apply)

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 2
          [32m+[0m[0m max_size     = 10
          [32m+[0m[0m min_size     = 1
        }

      [32m+[0m[0m update_config {
          [32m+[0m[0m max_unavailable = 1
        }
    }

[1m  # aws_iam_openid_connect_provider.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_openid_connect_provider" "cluster" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m client_id_list  = [
          [32m+[0m[0m "sts.amazonaws.com",
        ]
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev-oidc"
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Name"        = "tekmetric-dev-oidc"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m thumbprint_list = (known after apply)
      [32m+[0m[0m url             = (known after apply)
    }

[1m  # aws_iam_role.cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "cluster" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "tekmetric-dev-cluster-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role.node_group[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "node_group" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "tekmetric-dev-node-group-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "eks"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.cluster_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cluster_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m[0m role       = "tekmetric-dev-cluster-role"
    }

[1m  # aws_iam_role_policy_attachment.cluster_vpc_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cluster_vpc_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      [32m+[0m[0m role       = "tekmetric-dev-cluster-role"
    }

[1m  # aws_iam_role_policy_attachment.node_group_cni_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_group_cni_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = "tekmetric-dev-node-group-role"
    }

[1m  # aws_iam_role_policy_attachment.node_group_registry_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_group_registry_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      [32m+[0m[0m role       = "tekmetric-dev-node-group-role"
    }

[1m  # aws_iam_role_policy_attachment.node_group_worker_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "node_group_worker_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      [32m+[0m[0m role       = "tekmetric-dev-node-group-role"
    }

[1mPlan:[0m 14 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m cluster_arn                        = (known after apply)
  [32m+[0m[0m cluster_certificate_authority_data = (known after apply)
  [32m+[0m[0m cluster_endpoint                   = (known after apply)
  [32m+[0m[0m cluster_iam_role_arn               = (known after apply)
  [32m+[0m[0m cluster_id                         = (known after apply)
  [32m+[0m[0m cluster_oidc_issuer_url            = (known after apply)
  [32m+[0m[0m cluster_security_group_id          = (known after apply)
  [32m+[0m[0m node_group_iam_role_arn            = (known after apply)
  [32m+[0m[0m node_groups                        = {
      [32m+[0m[0m general = {
          [32m+[0m[0m arn           = (known after apply)
          [32m+[0m[0m capacity_type = "ON_DEMAND"
          [32m+[0m[0m id            = (known after apply)
          [32m+[0m[0m status        = (known after apply)
        }
    }
  [32m+[0m[0m oidc_provider_arn                  = (known after apply)
[0m[1maws_iam_role.node_group: Creating...[0m[0m
[0m[1maws_iam_role.cluster: Creating...[0m[0m
[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mcreating IAM Role (tekmetric-dev-cluster-role): operation error IAM: CreateRole, https response error StatusCode: 409, RequestID: 805658fc-2245-4bdf-bfa5-33ca6214db86, EntityAlreadyExists: Role with name tekmetric-dev-cluster-role already exists.[0m
[31m│[0m [0m
[31m│[0m [0m[0m  with aws_iam_role.cluster,
[31m│[0m [0m  on main.tf line 26, in resource "aws_iam_role" "cluster":
[31m│[0m [0m  26: resource "aws_iam_role" "cluster" [4m{[0m[0m
[31m│[0m [0m
[31m╵[0m[0m
[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mcreating IAM Role (tekmetric-dev-node-group-role): operation error IAM: CreateRole, https response error StatusCode: 409, RequestID: ff478dc9-c4c1-41c2-9236-10a062013b3d, EntityAlreadyExists: Role with name tekmetric-dev-node-group-role already exists.[0m
[31m│[0m [0m
[31m│[0m [0m[0m  with aws_iam_role.node_group,
[31m│[0m [0m  on main.tf line 106, in resource "aws_iam_role" "node_group":
[31m│[0m [0m 106: resource "aws_iam_role" "node_group" [4m{[0m[0m
[31m│[0m [0m
[31m╵[0m[0m
time=2025-12-11T09:12:56Z level=info msg=Encountered an error eligible for retrying. Sleeping 5s before retrying.
 prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks] 
[0m[1maws_cloudwatch_log_group.cluster: Refreshing state... [id=/aws/eks/tekmetric-dev/cluster][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_addon_version.coredns[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "coredns" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.ebs_csi_driver[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "ebs_csi_driver" {
      [32m+[0m[0m addon_name         = "aws-ebs-csi-driver"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.kube_proxy[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "kube_proxy" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.vpc_cni[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "vpc_cni" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.tls_certificate.cluster[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "tls_certificate" "cluster" {
      [32m+[0m[0m certificates = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m url          = (known after apply)
    }

[1m  # aws_eks_addon.coredns[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "coredns" {
      [32m+[0m[0m addon_name                  = "coredns"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "t

... (truncated)

See full output in job logs.
```

</details>

**Resources:**
- [EKS Console](https://console.aws.amazon.com/eks/home?region=us-east-1#/clusters/tekmetric-dev)
- [Full logs](https://github.com/actekmetric/interview/actions/runs/20127801022)
